{ //https://api.themoviedb.org/3/movie/297762/reviews?api_key=eba98b8d5917adbbd6415016502347f4
  "id": 297762,
  "page": 1,
  "results": [
    {
      "id": "59303b4c92514166e9000f76",
      "author": "Gimly",
      "content": "I'd just like to thank Patty Jenkins for making a DCIThoughtSheWasWithUniverse movie that wasn't fucking garbage.\r\n\r\nIf I'm being completely honest, the two people I went to the cinema to watch _Wonder Woman_ with and I did spend the next two hours after coming out of our screening discussing the various problems with the movie, but we also all agreed on one thing: We still loved it.\r\n\r\nMaybe it's just the rose-coloured glasses of comparison, but I had an excellent time with _Wonder Woman_, and I'm excited to go back to the cinema and watch it, at least one more time.\r\n\r\nIt's the first time I've said that about a DC movie since _The Dark Knight Rises_.\r\n\r\n_Final rating:★★★½ - I strongly recommend you make the time._",
      "url": "https://www.themoviedb.org/review/59303b4c92514166e9000f76"
    },
    {
      "id": "593476aec3a3685a2402386d",
      "author": "Movie Queen41",
      "content": "**The First Great DCEU Film**\r\n\r\nThis film is the origin story of Diana Prince/Wonder Woman (Gal Gadot), who was first introduced in Batman v. Superman last year. She is born and trained on Themyscira, the hidden island where the powerful warrior women known as the Amazons live. One day, Steve Trevor (Chris Pine), an American World War I spy, crashes off the coast of Themyscira and is rescued by Diana and the two team up to take down Ares, the God of War, and the Germans, who are developing a very deadly form of mustard gas. There are fantastic action sequences in this film, especially by Gal Gadot. It's amazing to see her single-handedly storm the German front, inspiring the Allies to fight with her. Gadot takes over from the legendary Linda Carter and makes the role her own. She has great chemistry with Pine. They are complete equals in this film. It's refreshing to see the female lead in a superhero film not be the love interest. The only negative part of the film are the lackluster villains. Hopefully, Wonder Woman will have more formidable foes in future films.",
      "url": "https://www.themoviedb.org/review/593476aec3a3685a2402386d"
    },
    {
      "id": "59358fc692514174a1000015",
      "author": "in_the_crease",
      "content": "**DC Hits A...Bunt. But compared to the strikeouts, a bunt seems impressive.**\r\n\r\nWonder Woman had some things working for it--things other comic book movies have faltered on. But it had a lot of things not working for it too. The result is an average median between what works and what doesn't. While the film is spectacular within the struggling DCEU, as a stand alone film it's mediocre at best. \r\n\r\nDiana's origin story--how she came to be and how she came to be a super hero was refreshing. It showcased the world of the Amazon warriors. It was unique in the often cookie-cutter super hero origin stories. Patty Jenkins did a good job of framing it, but I think the character's origin story dating back to the comics has always been unique in comparison to other super heroes.\r\n\r\nThe result is that the first third or so of the movie is satisfying--despite dull performances from Gal Gadot and Chris Pine (who had zero chemistry as a couple). But once we leave the confines of the island and enter the real world, the movie becomes hit or miss. WWI (that's right, WWI now, not WWII. The reason for the change in setting is never apparent) London is portrayed in a way that is almost a distraction. Yes, the world isn't white washed; diversity is a thing--a wonderful thing at that. But DC's version of Captain America's Howling Commandos consist of an Arab and an American Indian. Diversity for diversity's sake becomes distracting--especially when paired with a low-rent Simon Pegg whose soul function is being a deadly sniper who never fires his weapon (that's helpful on a top-secret mission behind enemy lines). \r\n\r\nIt's almost as if the movie telegraphs all of these unnecessary plot hiccups to remind you that this is a super hero film, and no matter how much the mortal humans fail, it will all be okay because the super hero will save the day. \r\n\r\nThe dialogue can be clichéd at times, and the final theme of the movie--one of love conquering all and the acknowledgement that, overall, mankind is good, is laughable in it's amateur preachiness. \r\n\r\nBut what the film lacks in substance and script, it makes up for in the visuals. I found the action sequences to be great fun. Heavily stylized \"Matrix-style\" fight scenes seem right at home in a film about super hero Gods. The freeze frames worked too--as fight sequences froze in over-the-top super hero poses that harkened back to the source material's comic book roots.\r\n\r\nThe final confrontation between Wonder Woman and Ares--while dragging on a little long--was well done, being one of the few super hero movie climaxes that delivered. \r\n\r\nWhile aspects of the movie were so similar (Hell! Identical!) to Captain America: The First Avenger, I actually felt embarrassed for the filmmakers, I did come away thinking this was the movie Captain America should have been. It succeeded in places where Captain America failed miserably. \r\n\r\nThe movie is entertainment--pure, fun, pop-corn-gobbling entertainment. In that realm, it succeeds and succeeds well. But as a piece of cinematic art, it falls flat on its face with too many plot holes, script inconsistencies, clichés and mediocre acting. Wonder Woman will be an important movie for both the DCEU and the summer of 2017. But it lacks the magic and staying power of Nolan and Donner's contributions to DC comics' films.",
      "url": "https://www.themoviedb.org/review/59358fc692514174a1000015"
    }
  ],
  "total_pages": 1,
  "total_results": 3
}